Catalogs/ТипыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ТипыСкидок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазмерСкидки</Name>
					<Comment>Размер скидки в % или аболютном выражении</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индивидуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаСтоимостиОтделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относительная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадаетсяВДокументе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АбсолютнаяОтСтоимостиВО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексная</Name>
					<Comment>Состоящая из простых/комплексных скидок</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыСкидок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//////////////////////
//	СЛУЖЕБНЫЕ		//
//////////////////////

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Если Объект.ВидСкидки = Перечисления.ВидыСкидок.Абсолютная Или Объект.ВидСкидки = Перечисления.ВидыСкидок.АбсолютнаяОтСтоимостиВО Тогда
		Элементы.РамкаГруппыРазмерСкидки.Заголовок	= "Величина скидки, " + Объект.Валюта.Наименование;
		Элементы.Валюта.Видимость			= Истина;
	ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Тогда
		Элементы.РамкаГруппыРазмерСкидки.Заголовок	= "Величина скидки, %";
	Иначе
		Элементы.РамкаГруппыРазмерСкидки.Заголовок	= "Величина скидки";
	КонецЕсли;
	
	Если Объект.ВидСкидки	= Перечисления.ВидыСкидок.ЗадаетсяВДокументе Тогда
		Элементы.ПанельВеличиныСкидки.ТекущаяСтраница	= Элементы.СтраницаЗадаетсяВДокументе;
	Иначе
		Элементы.ПанельВеличиныСкидки.ТекущаяСтраница	= Элементы.СтраницаВеличинаСкидки;
	КонецЕсли;
	
	Если Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Или Объект.ВидСкидки = Перечисления.ВидыСкидок.ЗадаетсяВДокументе Тогда
		Элементы.Валюта.Видимость			= Ложь;
	КонецЕсли;
    
    Элементы.БезУчетаСтоимостиОтделки.Видимость = Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьВкладокПанели()
	Если Объект.ВидСкидки =  Перечисления.ВидыСкидок.Комплексная Тогда 
		Элементы.Панель.ТекущаяСтраница = Элементы.СложнаяСкидка;
	Иначе	
		Элементы.Панель.ТекущаяСтраница = Элементы.ОбычнаяСкидка;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВидСкидкиПриИзмененииНаСервере()
	Объект.РазмерСкидки = 0;
	Объект.Состав.Очистить();
    Если Объект.БезУчетаСтоимостиОтделки и Не Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Тогда 
        Объект.БезУчетаСтоимостиОтделки = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуСсылку()
	Возврат Справочники.ТипыСкидок.ПустаяСсылка();
КонецФункции	

&НаСервере
Процедура ОбновитьОписаниеВидаСкидки()
	//Если Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Тогда 
	//    Если Не Объект.БезУчетаСтоимостиОтделки Тогда 
	//        Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = (Цена по договору[ОН] * (Размер скидки / 100)) * Площадь[ОН]";
	//    Иначе
	//        Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = ((Цена по договору[ОН] - Цена за 1м² отделки[ОН]) * (Размер скидки / 100)) * Площадь[ОН]"; 
	//    КонецЕсли;    
	//ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.Абсолютная Тогда 
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = Размер скидки * Площадь[ОН]";
	//ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.АбсолютнаяОтСтоимостиВО Тогда 
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = (Площадь[ОН] / Общая площадь) * Размер скидки";
	//ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.Комплексная Тогда 
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки расчитывается последовательно";		
	//Иначе
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Указывается в документе";
	//КонецЕсли;
КонецПроцедуры

 &НаСервере
Функция ЭтоКомплекснаяСкидкаВСоставеКоторойЕстьСсылкаНаЭтуСкидку(ВыбранноеЗначение)
	Скидка = ВыбранноеЗначение;
	Если Не Скидка = Неопределено и Скидка.ВидСкидки = Перечисления.ВидыСкидок.Комплексная Тогда 
		Возврат ПроверитьСоставНаВхождениеРекурсивнойСсылки(Скидка);
	Иначе Возврат Ложь;	КонецЕсли;
КонецФункции

 &НаСервере
Функция ПроверитьСоставНаВхождениеРекурсивнойСсылки(Скидка)
	Для Каждого СкидкаСостава из  Скидка.Состав Цикл 
		Если СкидкаСостава.Скидка = Объект.Ссылка Тогда 
			Возврат Истина;
		ИначеЕсли СкидкаСостава.Скидка.ВидСкидки = Перечисления.ВидыСкидок.Комплексная и ПроверитьСоставНаВхождениеРекурсивнойСсылки(СкидкаСостава.Скидка) Тогда 
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;
КонецФункции		




//////////////////////////////////
//	ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ	//
//////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбработатьВидимостьВкладокПанели();
	УправлениеВидимостьюДоступностью();
	ОбновитьОписаниеВидаСкидки();
КонецПроцедуры

//////////////////////////////////////////
//	ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ	//
//////////////////////////////////////////

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	ВидСкидкиПриИзмененииНаСервере();
	УправлениеВидимостьюДоступностью();
	ОбработатьВидимостьВкладокПанели();
	ОбновитьОписаниеВидаСкидки();
КонецПроцедуры

&НаКлиенте
Процедура СоставСкидкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Объект.Ссылка Тогда 
		СтандартнаяОбработка = Ложь;
		Элемент = ПолучитьПустуСсылку();
		ВыбранноеЗначение = Элемент;
	ИначеЕсли ЭтоКомплекснаяСкидкаВСоставеКоторойЕстьСсылкаНаЭтуСкидку(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		Элемент = ПолучитьПустуСсылку();
		ВыбранноеЗначение = Элемент;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры


&НаКлиенте
Процедура БезУчетаСтоимостиОтделкиПриИзменении(Элемент)
    ОбновитьОписаниеВидаСкидки();
КонецПроцедуры
